Revit 2027 API
BuiltInFailures.RebarFailures.UnconstrainableRebarHandle Property
 The rebar handle does not have any constraint targets.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnconstrainableRebarHandle { get; }
Public Shared ReadOnly Property UnconstrainableRebarHandle As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnconstrainableRebarHandle {
	FailureDefinitionId^ get ();
}
static member UnconstrainableRebarHandle : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace